Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectFrame Constructor (LineTypes, DrawingColors)
 Creates a new embedded object frame instance with the specified line type and color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EmbeddedObjectFrame(
	LineTypes LineType,
	DrawingColors FrameColor
)
Public Sub New (
	LineType As LineTypes,
	FrameColor As DrawingColors
)
Parameters
LineType
Type: Tekla.Structures.Drawing.LineTypes
The line type of the frame.
FrameColor
Type: Tekla.Structures.Drawing.DrawingColors
The color of the frame.
See Also
Reference
EmbeddedObjectFrame Class
EmbeddedObjectFrame Overload
Tekla.Structures.Drawing Namespace